<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Studio 3T and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.munki-tvlk.munki.Studio3T</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Studio3T (Apple)</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>Testing</string>
			</array>
			<key>description</key>
			<string>Studio 3T — is a shell-centric cross-platform open source MongoDB management tool (i.e. Admin GUI)</string>
			<key>developer</key>
			<string>3T Software Labs GmbH</string>
			<key>display_name</key>
			<string>Studio 3T (Apple)</string>
			<key>name</key>
			<string>%NAME%</string>
 			<key>supported_architectures</key>
            		<array>
                	<string>arm64</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.munki-tvlk.download.Studio3T</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
