<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Studio 3T.</string>
	<key>Identifier</key>
	<string>com.github.munki-tvlk.download.Studio3Tx86</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Studio3T (Intel)</string>
		<key>Comment</key>
		<string>Override ARCH with mac-aarch64 for Apple Silicon Version</string>
		<key>ARCH</key>
		<string>mac</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>Studio 3T ([0-9\.]+)</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://studio3t.com/download/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%ARCH%-%version%.dmg</string>
				<key>url</key>
				<string>https://download.studio3t.com/studio-3t/%ARCH%/%version%/Studio-3T.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Studio 3T.app</string>
				<key>requirement</key>
				<string>always</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Studio 3T.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
