<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<key>Identifier</key>
    <string>com.github.munki-tvlk.munki.AdobeCC-arm64</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>Adobe_CC</string>
      <key>NAME</key>
      <string>Adobe CC (Apple)</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>Testing</string>
        </array>
        <key>category</key>
        <string>Creative Cloud</string>
        <key>description</key>
        <string>The Creative Cloud app runs in the menu bar and allows you to install, update or remove Creative Cloud applications for which you are licensed.</string>
        <key>developer</key>
        <string>Adobe</string>
        <key>display_name</key>
        <string>Adobe CC</string>
        <key>name</key>
        <string>Creative_Cloud_Installer</string>
		<key>supported_architectures</key>
		<array>
			<string>arm64</string>
		</array>
        <key>unattended_install</key>
        <true/>
        <key>uninstall_method</key>
        <string>uninstall_script</string>
        <key>uninstall_script</key>
      <string>#!/bin/bash
"/Applications/Utilities/Adobe Creative Cloud/Utils/Creative Cloud Uninstaller.app/Contents/MacOS/Creative Cloud Uninstaller" -u
</string>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.munki-tvlk.download.AdobeCC-arm64</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>additional_pkginfo</key>
          <dict>
            <key>installs</key>
            <array>
              <dict>
                <key>CFBundleName</key>
                <string>Creative Cloud</string>
                <key>CFBundleShortVersionString</key>
                <string>%version%</string>
                <key>path</key>
                <string>/Applications/Utilities/Adobe Creative Cloud/ACC/Creative Cloud.app</string>
                <key>type</key>
                <string>application</string>
                <key>version_comparison_key</key>
                <string>CFBundleShortVersionString</string>
              </dict>
            </array>
          </dict>
        </dict>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pkg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
