<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest AWS Session Manager plugin package.

DOWNLOAD_ARCH
Use the values between double quotes below for arch specific downloads.
- "" (empty): x86_64/Intel
- "_arm64": arm64/Apple silicon
    </string>
    <key>Identifier</key>
    <string>com.github.munki-tvlk.download.AWSSessionManagerPluginx86</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AWS Session Manager Plugin (Intel)</string>
        <key>DOWNLOAD_ARCH</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://s3.amazonaws.com/session-manager-downloads/plugin/latest/mac%DOWNLOAD_ARCH%/session-manager-plugin.pkg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: AMZN Mobile LLC (94KV3E626L)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
