<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the most recent version of Go for OS X from the official
Golang downloads page.

As there are separate installers for Intel and Apple Silicon, you will need
to override two input variables: ARCH and SUPPORTED_ARCHITECTURE, due to how
these are specified in URLs and by Munki. You can create multiple recipe overrides
if you need to import both flavors of the installer.

For Apple Silicon:
ARCH: arm64, SUPPORTED_ARCHITECTURE: arm64

For Intel:
ARCH: amd64, SUPPORTED_ARCHITECTURE: x86_64
</string>
    <key>Identifier</key>
    <string>com.github.munki-tvlk.download.Go</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Go (Apple)</string>
        <key>ARCH</key>
        <string>arm64</string>
        <key>RE_PATTERN</key>
        <string>href="(?P&lt;href&gt;\/dl.*?go(?P&lt;version&gt;.*?)\.darwin-%ARCH%.pkg)"</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://golang.org/dl/</string>
                <key>re_pattern</key>
                <string>%RE_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://golang.org/%href%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Google LLC (EQHXZ8M8AV)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
