<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Spotify.

For Apple Silicon set DOWNLOAD_ARCH to "ARM64" and SUPPORTED_ARCH to "arm64" (default)

For Intel leave DOWNLOAD_ARCH empty and set SUPPORTED_ARCH to "x86_64"</string>
    <key>Identifier</key>
    <string>com.github.munki-tvlk.download.Spotify</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Spotify (Apple)</string>
        <key>DOWNLOAD_ARCH</key>
        <string>ARM64</string>
        <key>SUPPORTED_ARCH</key>
        <string>arm64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.scdn.co/Spotify%DOWNLOAD_ARCH%.dmg</string>
                <key>filename</key>
                <string>%NAME%-%SUPPORTED_ARCH%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Spotify.app</string>
                <key>requirement</key>
                <string>identifier "com.spotify.client" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2FNC3A47ZF"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
