<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Creative Cloud Desktop v2.2 dmg and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.munki-tvlk.munki.CreativeCloudDesktop</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>CreativeCloudDesktop</string>
		<key>URL</key>
		<string>https://ccmdls.adobe.com/AdobeProducts/KCCC/1/osx10/CreativeCloudInstaller.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%URL%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
        <dict>
	        <key>Processor</key>
	        <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkginfo</key>
				<dict>
					<key>description</key>
					<string>Creative Cloud Desktop gives you the world’s favorite Adobe creative tools, always up to date.</string>
					<key>installer_type</key>
					<string>copy_from_dmg</string>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleName</key>
							<string>Adobe Application Manager</string>
							<key>CFBundleShortVersionString</key>
							<string>2.2.0.129</string>
							<key>CFBundleVersion</key>
							<string>2.2.0.129</string>
							<key>minosversion</key>
							<string>10.5</string>
							<key>path</key>
							<string>/Applications/Utilities/Adobe Creative Cloud/ACC/Creative Cloud.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleShortVersionString</string>
						</dict>
					</array>
					<key>items_to_copy</key>
					<array>
						<dict>
							<key>destination_path</key>
							<string>/tmp</string>
							<key>source_item</key>
							<string>Creative Cloud Installer.app</string>
						</dict>
					</array>
					<key>name</key>
					<string>%NAME%</string>
					<key>postinstall_script</key>
					<string>#!/bin/sh
					/tmp/Creative\ Cloud\ Installer.app/Contents/MacOS/Install --mode=silent
					exit $?
					</string>
					<key>uninstall_method</key>
					<string>uninstall_script</string>
					<key>uninstall_script</key>
					<string>#!/bin/sh
					rm -rf /Applications/Utilities/Adobe\ Creative\ Cloud
					exit $?
					</string>
					<key>uninstallable</key>
					<true/>
					<key>version</key>
					<string>2.2.0.129</string>
				</dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
